# Operation

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'Col1': [1,2,3,4],'Col2': [100,200,300,100], 'Col3': ['abc', 'def', 'ghi', 'xyz']})

In [3]:
df

   Col1  Col2 Col3
0     1   100  abc
1     2   200  def
2     3   300  ghi
3     4   100  xyz

In [4]:
df.head()

   Col1  Col2 Col3
0     1   100  abc
1     2   200  def
2     3   300  ghi
3     4   100  xyz

In [5]:
df['Col2'].unique()

array([100, 200, 300], dtype=int64)

In [6]:
df['Col2'].nunique()

3

In [7]:
df['Col2'].value_counts()

100    2
200    1
300    1
Name: Col2, dtype: int64

# ***Selecting Data***

In [8]:
newdf = df[(df['Col1']<3) & (df['Col2']==100)]

In [9]:
newdf

   Col1  Col2 Col3
0     1   100  abc

# Apply Function

In [10]:
def myfunc(x):
    return x+10

In [11]:
myfunc(5)

15

In [12]:
df['Col2'].apply(myfunc)

0    110
1    210
2    310
3    110
Name: Col2, dtype: int64

In [13]:
df['Col1'].apply(myfunc)

0    11
1    12
2    13
3    14
Name: Col1, dtype: int64

In [14]:
df['Col3'].apply(len)

0    3
1    3
2    3
3    3
Name: Col3, dtype: int64

In [15]:
df['Col2'].sum()

700

**Permanently removing a column**

In [16]:
del df['Col2']

In [17]:
df

   Col1 Col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

**Column & index name**

In [18]:
df.columns

Index(['Col1', 'Col3'], dtype='object')

In [19]:
df.index

RangeIndex(start=0, stop=4, step=1)

**Sorting & ordering Columns**

In [20]:
df.sort_values(by='Col1') # inplace false by default

   Col1 Col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [21]:
df.isnull()

    Col1   Col3
0  False  False
1  False  False
2  False  False
3  False  False

In [22]:
df.dropna()      # it drops Nan values

   Col1 Col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

# Filing Nan Values

In [24]:
import numpy as np

In [30]:
df = pd.DataFrame({'Col1': [10,20,30,np.nan],
                   'Col2': [np.nan,33,44,55],
                   'Col3': ['abc', 'def', 'ghi', 'jkl']})

In [31]:
df.head()

   Col1  Col2 Col3
0  10.0   NaN  abc
1  20.0  33.0  def
2  30.0  44.0  ghi
3   NaN  55.0  jkl

In [32]:
df.fillna(40)

   Col1  Col2 Col3
0  10.0  40.0  abc
1  20.0  33.0  def
2  30.0  44.0  ghi
3  40.0  55.0  jkl

In [33]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [34]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [37]:
df.pivot_table(values= "D", index = ['A','B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [38]:
Money = {"Name": ['Aadil', 'Aadil', 'Aadil', 'Equbal', 'Equbal', 'Equbal'],
         'Currency': ['Dollar', 'Dollar', 'Rupee', 'Rupee', 'Dollar', 'Rupee'],
         'Note': [50,100,50,100,50,100],
         'Number of Note':[1,3,2,6,4,8]}

In [41]:
df = pd.DataFrame(Money)
df

     Name Currency  Note  Number of Note
0   Aadil   Dollar    50               1
1   Aadil   Dollar   100               3
2   Aadil    Rupee    50               2
3  Equbal    Rupee   100               6
4  Equbal   Dollar    50               4
5  Equbal    Rupee   100               8

In [42]:
df.pivot_table(values = 'Number of Note', index = ['Name', 'Currency'], columns = 'Note')

Note             50   100
Name   Currency
Aadil  Dollar    1.0  3.0
       Rupee     2.0  NaN
Equbal Dollar    4.0  NaN
       Rupee     NaN  7.0

# Thank you!